if __name__ == "__main__" :
    fruit = {
        "사과" : 1000,
        "배" : 2000,
        "감" : 3000,
        "샤인머스켓" : 4000,
        "딸기" : 5000,
        "바나나" : 6000,
        "포도" : 7000,
        "블루베리" : 8000,
    }

    print( "[1] 사과,   [2] 배,     [3] 감,     [4] 샤인머스켓,  [5]딸기,     [6] 바나나, [7] 포도,   [8] 블루베리" )
    print( "[1] 1000원, [2] 2000원, [3] 3000원, [4] 4000원,      [5] 5000원,  [6] 6000원, [7] 7000원, [8] 8000원")
    input = input( "주문할 과일을 입력해 주세요 : " )

    if input in fruit :
        if fruit.get( input ) < 5000  :
            print( "최소 주문금액을 채워주세요" )
        else :
            print( fruit.get( input ), "원은 구매가 가능합니다." )
    else :
        print( "해당 과일은 존재하지 않음" )