if __name__ == "__main__" :
    grade, group = map( int, input( "학년, 반 입력 : " ).split() )

    teacher = {
        1 : {
            1 : "1 선생님",
            2 : "2 선생님",
            3 : "3 선생님",
            4 : "4 선생님",
            5 : "5 선생님",
            6 : "6 선생님",
        },
        2 : {
            1 : "정혜선 선생님",
            2 : "권지웅 선생님",
            3 : "박성래 선생님",
            4 : "임진하 선생님",
            5 : "5 선생님",
            6 : "6 선생님"
        },
        3 : {
            1 : "1반 쌤",
            2 : "2반 쌤",
            3 : "3반 쌤",
            4 : "4반 쌤",
            5 : "5반 쌤",
            6 : "6반 쌤",
        }
        
    }

    if teacher.get( grade ).get( group ) :
        print( teacher.get( grade ).get( group ) )